In [1]:
import pandas as pd

In [2]:
li = { "Name" : ["Zohaib", "Iqra", "Sara"], "Age" : [20, 19, 20], "Slary":[1000000, 200000, 300800]}

In [3]:
pd.DataFrame(li)

     Name  Age    Slary
0  Zohaib   20  1000000
1    Iqra   19   200000
2    Sara   20   300800

In [14]:
database = pd.read_excel("multiple_linear_regression.xlsx")
database.head(5)

                  Name  Age  Experience (Years)  Education (Years)    Salary
0  Mr. Johnathan Davis   56                   8                 15  14372.40
1           Kelly Reed   46                   7                 10  12641.59
2        Chelsea Moore   32                  11                 18  13918.89
3        Paige Goodwin   25                  33                 15  16396.54
4        Kelly Rosario   38                  32                 12  15350.48

In [15]:
# database.drop(columns=["Name"], inplace=True)

In [16]:
database

                   Name  Age  Experience (Years)  Education (Years)    Salary
0   Mr. Johnathan Davis   56                   8                 15  14372.40
1            Kelly Reed   46                   7                 10  12641.59
2         Chelsea Moore   32                  11                 18  13918.89
3         Paige Goodwin   25                  33                 15  16396.54
4         Kelly Rosario   38                  32                 12  15350.48
..                  ...  ...                 ...                ...       ...
95         Stacy Oneill   59                  37                 10  18533.58
96     Michelle Delgado   56                  23                 14  16357.04
97        Jacob Watkins   58                   4                 15  15326.47
98          David Stone   45                  33                 12  17998.65
99           Sara Patel   24                   5                 18   9321.27

[100 rows x 5 columns]

In [17]:
database.isnull().sum()

Name                  0
Age                   0
Experience (Years)    0
Education (Years)     0
Salary                0
dtype: int64

In [18]:
database.shape

(100, 5)

In [19]:
database.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Name                100 non-null    object
 1   Age                 100 non-null    int64
 2   Experience (Years)  100 non-null    int64
 3   Education (Years)   100 non-null    int64
 4   Salary              100 non-null    float64
dtypes: float64(1), int64(3), object(1)
memory usage: 4.0+ KB

In [20]:
database.describe()

              Age  Experience (Years)  Education (Years)        Salary
count  100.000000           100.00000         100.000000    100.000000
mean    37.910000            20.41000          13.860000  14125.654700
std     12.219454            12.60519           2.774414   3084.505346
min     18.000000             0.00000          10.000000   6700.620000
25%     26.750000             8.00000          12.000000  12018.860000
50%     38.000000            23.00000          13.000000  13895.580000
75%     46.250000            31.00000          16.000000  16366.915000
max     59.000000            39.00000          19.000000  21810.400000

In [27]:
# data : int =database["Name"].duplicated().sum()
data : int =database.duplicated().sum()
data

np.int64(0)

In [29]:
database.drop_duplicates(inplace=True)

In [30]:
database.dropna(inplace=True)